Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
#ifndef RA8M1_OSPI_H
#define RA8M1_OSPI_H

// =============================================================================
// RA8M1 OSPI (Octal Serial Peripheral Interface) Register Map
// =============================================================================

#define OSPI0_B_BASE                  0x40268000UL  // OSPI0 base address (secure)
#define OSPI0_B_NS_BASE               0x50268000UL  // OSPI0 base address (non-secure)

// =============================================================================
// Register Offsets
// =============================================================================

#define OSPI_WRAPCFG_OFS              0x000                  // Wrapper Configuration Register
#define OSPI_COMCFG_OFS               0x004                  // Common Configuration Register
#define OSPI_BMCFGCH_OFS(n)           (0x008 + 0x004 * (n))  // Bridge Map Configuration Register chn (n=0,1)
#define OSPI_CMCFG0CS_OFS(n)          (0x010 + 0x010 * (n))  // Command Map Configuration Register 0 CSn (n=0,1)
#define OSPI_CMCFG1CS_OFS(n)          (0x014 + 0x010 * (n))  // Command Map Configuration Register 1 CSn
#define OSPI_CMCFG2CS_OFS(n)          (0x018 + 0x010 * (n))  // Command Map Configuration Register 2 CSn
#define OSPI_LIOCFGCS_OFS(n)          (0x050 + 0x004 * (n))  // Link I/O Configuration Register CSn
#define OSPI_BMCTL0_OFS               0x060                  // Bridge Map Control Register 0
#define OSPI_BMCTL1_OFS               0x064                  // Bridge Map Control Register 1
#define OSPI_CMCTLCH_OFS(n)           (0x068 + 0x004 * (n))  // Command Map Control Register chn (n=0,1)
#define OSPI_CDCTL0_OFS               0x070                  // Command Manual Control Register 0
#define OSPI_CDCTL1_OFS               0x074                  // Command Manual Control Register 1
#define OSPI_CDCTL2_OFS               0x078                  // Command Manual Control Register 2
#define OSPI_CDTBUF_OFS(n)            (0x080 + 0x010 * (n))  // Command Transaction Buffer (n=0..3)
#define OSPI_CDABUF_OFS(n)            (0x084 + 0x010 * (n))  // Command Address Buffer
#define OSPI_CDD0BUF_OFS(n)           (0x088 + 0x010 * (n))  // Command Data0 Buffer
#define OSPI_CDD1BUF_OFS(n)           (0x08C + 0x010 * (n))  // Command Data1 Buffer
#define OSPI_LPCTL0_OFS               0x100                  // Link Pattern Control Register 0
#define OSPI_LPCTL1_OFS               0x104                  // Link Pattern Control Register 1
#define OSPI_LIOCTL_OFS               0x108                  // Link I/O Control Register

// Calibration/Status block
#define OSPI_CCCTL0CS_OFS(n)          (0x130 + 0x020 * (n))  // Calibration Control Register 0 CSn (n=0,1)
#define OSPI_CCCTL1CS_OFS(n)          (0x134 + 0x020 * (n))  // Calibration Control Register 1 CSn
#define OSPI_CCCTL2CS_OFS(n)          (0x138 + 0x020 * (n))  // Calibration Control Register 2 CSn
#define OSPI_CCCTL3CS_OFS(n)          (0x13C + 0x020 * (n))  // Calibration Control Register 3 CSn
#define OSPI_CCCTL4CS_OFS(n)          (0x140 + 0x020 * (n))  // Calibration Control Register 4 CSn
#define OSPI_CCCTL5CS_OFS(n)          (0x144 + 0x020 * (n))  // Calibration Control Register 5 CSn
#define OSPI_CCCTL6CS_OFS(n)          (0x148 + 0x020 * (n))  // Calibration Control Register 6 CSn
#define OSPI_CCCTL7CS_OFS(n)          (0x14C + 0x020 * (n))  // Calibration Control Register 7 CSn
#define OSPI_COMSTT_OFS               0x184                  // Common Status Register
#define OSPI_CASTTCS_OFS(n)           (0x188 + 0x004 * (n))  // Calibration Status Register CSn (n=0,1)

#define OSPI_INTS_OFS                 0x190                  // Interrupt Status Register
#define OSPI_INTC_OFS                 0x194                  // Interrupt Clear Register
#define OSPI_INTE_OFS                 0x198                  // Interrupt Enable Register

// =============================================================================
// OSPI_WRAPCFG - Wrapper Configuration Register
// =============================================================================

// DQS Shift Value for CS0 (bits 12:8).
// Specifies the amount of delay applied to the DQS (Data Strobe) input for chip select 0.
// Range: 0 (no delay) to 31 (maximum delay, 31 delay cells). Used to align DQS timing for high-speed operation.
#define OSPI_WRAPCFG_DSSFTCS0_Pos     8
#define OSPI_WRAPCFG_DSSFTCS0_Msk     (0x1FU << OSPI_WRAPCFG_DSSFTCS0_Pos)

// DQS Shift Value for CS1 (bits 28:24).
// Specifies the amount of delay applied to the DQS (Data Strobe) input for chip select 1.
// Range: 0 (no delay) to 31 (maximum delay, 31 delay cells). Used to align DQS timing for high-speed operation.
#define OSPI_WRAPCFG_DSSFTCS1_Pos     24
#define OSPI_WRAPCFG_DSSFTCS1_Msk     (0x1FU << OSPI_WRAPCFG_DSSFTCS1_Pos)

// =============================================================================
// OSPI_COMCFG - Common Configuration Register
// =============================================================================

// Output Enable Assert Extension (bit 16).
// When set to 1, extends the assertion (active phase) of the OE (Output Enable) signal by 1 PCLKA clock cycle.
// 0 = No extension; 1 = Assertion extended by 1 cycle.
#define OSPI_COMCFG_OEASTEX_Pos       16
#define OSPI_COMCFG_OEASTEX_Msk       (1U << OSPI_COMCFG_OEASTEX_Pos)

// Output Enable Negate Extension (bit 17).
// When set to 1, extends the negation (inactive phase) of the OE (Output Enable) signal by 1 PCLKA clock cycle.
// 0 = No extension; 1 = Negation extended by 1 cycle.
#define OSPI_COMCFG_OENEGEX_Pos       17
#define OSPI_COMCFG_OENEGEX_Msk       (1U << OSPI_COMCFG_OENEGEX_Pos)

// =============================================================================
// OSPI_BMCFGCHn - Bridge Map Configuration Register chn (n=0,1)
// The BMCFGCHn register configures the memory-mapped interface behavior for the OSPI bridge channel n (typically, n=0 for CS0, n=1 for CS1).
// It controls write response behavior, write combination mode, write size,
// prefetch settings, and the write combination timer for optimal performance and compatibility with different memory devices.
// =============================================================================

// Write Response Mode (bit 0).
// 0 = Write response by memory device (waits for memory ready).
// 1 = Write response by OSPI controller (does not wait for memory).
#define OSPI_BMCFGCH_WRMD_Pos         0
#define OSPI_BMCFGCH_WRMD_Msk         (1U << OSPI_BMCFGCH_WRMD_Pos)

// Memory Write Combination Enable (bit 7).
// 0 = Disable (each write is issued immediately).
// 1 = Enable (writes are combined into a single burst transaction when possible).
#define OSPI_BMCFGCH_MWRCOMB_Pos      7
#define OSPI_BMCFGCH_MWRCOMB_Msk      (1U << OSPI_BMCFGCH_MWRCOMB_Pos)

// Memory Write Size (bits 15:8).
// Sets the write transaction size in bytes (encoded):
// 0x00 = 4 bytes, 0x01 = 8 bytes, ..., 0x0F = 64 bytes, 0xFF = 2 bytes.
#define OSPI_BMCFGCH_MWRSIZE_Pos      8
#define OSPI_BMCFGCH_MWRSIZE_Msk      (0xFFU << OSPI_BMCFGCH_MWRSIZE_Pos)

// Prefetch Enable (bit 16).
// 0 = Prefetch disabled.
// 1 = Prefetch enabled (read-ahead for improved throughput).
#define OSPI_BMCFGCH_PREEN_Pos        16
#define OSPI_BMCFGCH_PREEN_Msk        (1U << OSPI_BMCFGCH_PREEN_Pos)

