Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
// Write Combination Timer (bits 31:24).
// Sets the time (in PCLKA clock cycles) to wait for additional write data before issuing a combined write transaction.
// 0x00 = Timer disabled, 0x01–0xFF = wait up to N cycles.
#define OSPI_BMCFGCH_CMBTIM_Pos       24
#define OSPI_BMCFGCH_CMBTIM_Msk       (0xFFU << OSPI_BMCFGCH_CMBTIM_Pos)

// =============================================================================
// OSPI_CMCFG0CSn - Command Map Configuration Register 0 CSn (n=0,1)
// The CMCFG0CSn register defines the frame and address format, burst/array modes, and address replacement features for each chip select (CSn).
// This allows you to match the OSPI controller’s command/transfer framing to your external flash memory device requirements.
// =============================================================================

// Frame Format (bits 1:0).
// 0 = Standard SPI (1S-1S-1S).
// 1 = Octal DDR (8D-8D-8D) Profile 1.0.
// 2 = Octal DDR (8D-8D-8D) Profile 2.0 (Modified).
// 3 = Octal DDR (8D-8D-8D) Extended Mode.
#define OSPI_CMCFG0CSN_FFMT_Pos       0
#define OSPI_CMCFG0CSN_FFMT_Msk       (0x3U << OSPI_CMCFG0CSN_FFMT_Pos)

// Address Size (bits 3:2).
// 0 = 1 byte, 1 = 2 bytes, 2 = 3 bytes, 3 = 4 bytes.
#define OSPI_CMCFG0CSN_ADDSIZE_Pos    2
#define OSPI_CMCFG0CSN_ADDSIZE_Msk    (0x3U << OSPI_CMCFG0CSN_ADDSIZE_Pos)

// Wrapping Burst Mode Enable (bit 4).
// 0 = Disabled; 1 = Enabled (for supporting continuous burst with wrap).
#define OSPI_CMCFG0CSN_WPBSTMD_Pos    4
#define OSPI_CMCFG0CSN_WPBSTMD_Msk    (1U << OSPI_CMCFG0CSN_WPBSTMD_Pos)

// Array Address Mode (bit 5).
// 0 = Linear addressing; 1 = Array address mode enabled.
#define OSPI_CMCFG0CSN_ARYAMD_Pos     5
#define OSPI_CMCFG0CSN_ARYAMD_Msk     (1U << OSPI_CMCFG0CSN_ARYAMD_Pos)

// Address Replace Enable (bits 23:16).
// Each bit enables address replacement for a corresponding byte position in the address field.
// Bit 16 = enable for address byte 0, Bit 17 = for byte 1, ..., Bit 23 = for byte 7.
#define OSPI_CMCFG0CSN_ADDRPEN_Pos    16
#define OSPI_CMCFG0CSN_ADDRPEN_Msk    (0xFFU << OSPI_CMCFG0CSN_ADDRPEN_Pos)

// Address Replace Code (bits 31:24).
// Value to be used as the replacement byte when address replacement is enabled.
#define OSPI_CMCFG0CSN_ADDRPCD_Pos    24
#define OSPI_CMCFG0CSN_ADDRPCD_Msk    (0xFFU << OSPI_CMCFG0CSN_ADDRPCD_Pos)

// =============================================================================
// OSPI_CMCFG1CSn - Command Map Configuration Register 1 CSn (n=0,1)
// The CMCFG1CSn register sets the command code and dummy cycles (latency cycles) for memory read operations for each chip select (CSn).
// This allows the controller to send the correct command sequence and number of wait cycles,
// matching the requirements of the connected memory device.
// =============================================================================

// Read Command Code (bits 15:0).
// Specifies the opcode(s) used to initiate a read operation on the memory device.
// Typical values: 0x03 (read), 0x0B (fast read), 0xEB, 0xEC, etc.
#define OSPI_CMCFG1CSN_RDCMD_Pos      0
#define OSPI_CMCFG1CSN_RDCMD_Msk      (0xFFFFU << OSPI_CMCFG1CSN_RDCMD_Pos)

// Read Latency (bits 20:16).
// Number of dummy cycles (latency cycles) to insert between command/address phase and data phase.
// Range: 0–31. Set according to device timing requirements.
#define OSPI_CMCFG1CSN_RDLATE_Pos     16
#define OSPI_CMCFG1CSN_RDLATE_Msk     (0x1FU << OSPI_CMCFG1CSN_RDLATE_Pos)

// =============================================================================
// OSPI_CMCFG2CSn - Command Map Configuration Register 2 CSn (n=0,1)
// The CMCFG2CSn register configures the command code and dummy cycles (latency cycles) for memory write operations for each chip select (CSn).
// This allows the OSPI controller to issue the correct command and wait cycles to the connected memory device during writes.
// =============================================================================

// Write Command Code (bits 15:0).
// Specifies the opcode(s) used to initiate a write/program operation on the memory device.
// Typical values: 0x02 (Page Program), 0x38, 0x12, etc.
#define OSPI_CMCFG2CSN_WRCMD_Pos      0
#define OSPI_CMCFG2CSN_WRCMD_Msk      (0xFFFFU << OSPI_CMCFG2CSN_WRCMD_Pos)

// Write Latency (bits 20:16).
// Number of dummy cycles (latency cycles) to insert between command/address phase and data phase for write operations.
// Range: 0–31. Set according to device timing requirements.
#define OSPI_CMCFG2CSN_WRLATE_Pos     16
#define OSPI_CMCFG2CSN_WRLATE_Msk     (0x1FU << OSPI_CMCFG2CSN_WRLATE_Pos)

// =============================================================================
// OSPI_LIOCFGCSn - Link I/O Configuration Register CSn (n=0,1)
// The LIOCFGCSn register configures protocol, timing, and I/O settings for each chip select (CSn) line,
// enabling fine-tuning of the OSPI interface to match the requirements and capabilities of the connected memory device.
// =============================================================================

// Protocol Mode (bits 9:0).
// Selects SPI bus width and protocol (e.g. 1S-1S-1S, 8D-8D-8D, etc.).
// Typical values:
//   0x000 = 1S-1S-1S (standard SPI)
//   0x3B2 = 4S-4D-4D
//   0x3FF = 8D-8D-8D
#define OSPI_LIOCFGCSN_PRTMD_Pos      0
#define OSPI_LIOCFGCSN_PRTMD_Msk      (0x3FFU << OSPI_LIOCFGCSN_PRTMD_Pos)

// Latency Mode (bit 10).
// 0 = Standard mode, 1 = Variable/latency mode (device-specific).
#define OSPI_LIOCFGCSN_LATEMD_Pos     10
#define OSPI_LIOCFGCSN_LATEMD_Msk     (1U << OSPI_LIOCFGCSN_LATEMD_Pos)

// Write Mask Mode (bit 11).
// 0 = Normal write, 1 = Write with mask (for devices supporting masked writes).
#define OSPI_LIOCFGCSN_WRMSKMD_Pos    11
#define OSPI_LIOCFGCSN_WRMSKMD_Msk    (1U << OSPI_LIOCFGCSN_WRMSKMD_Pos)

// Minimum CS Inactive Cycles (bits 19:16).
// Minimum number of PCLKA cycles CS remains inactive between frames (0–15).
#define OSPI_LIOCFGCSN_CSMIN_Pos      16
#define OSPI_LIOCFGCSN_CSMIN_Msk      (0xFU << OSPI_LIOCFGCSN_CSMIN_Pos)

// CS Assert Extension (bit 20).
// 0 = Normal CS assertion; 1 = CS assertion is extended by 1 PCLKA cycle.
#define OSPI_LIOCFGCSN_CSASTEX_Pos    20
#define OSPI_LIOCFGCSN_CSASTEX_Msk    (1U << OSPI_LIOCFGCSN_CSASTEX_Pos)

// CS Negate Extension (bit 21).
// 0 = Normal CS negation; 1 = CS negation is extended by 1 PCLKA cycle.
#define OSPI_LIOCFGCSN_CSNEGEX_Pos    21
#define OSPI_LIOCFGCSN_CSNEGEX_Msk    (1U << OSPI_LIOCFGCSN_CSNEGEX_Pos)

// SDR Output Drive (bit 22).
// 0 = Normal drive; 1 = Stronger drive for SDR signals (device-dependent).
#define OSPI_LIOCFGCSN_SDRDRV_Pos     22
#define OSPI_LIOCFGCSN_SDRDRV_Msk     (1U << OSPI_LIOCFGCSN_SDRDRV_Pos)

