Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
// SDR Sampling Mode (bit 23).
// 0 = Standard sampling; 1 = Custom/advanced sampling (device-dependent).
#define OSPI_LIOCFGCSN_SDRSMPMD_Pos   23
#define OSPI_LIOCFGCSN_SDRSMPMD_Msk   (1U << OSPI_LIOCFGCSN_SDRSMPMD_Pos)

// SDR Sampling Shift (bits 27:24).
// Shifts SDR data sampling point (in PCLKA cycles), range 0–15.
#define OSPI_LIOCFGCSN_SDRSMPSFT_Pos  24
#define OSPI_LIOCFGCSN_SDRSMPSFT_Msk  (0xFU << OSPI_LIOCFGCSN_SDRSMPSFT_Pos)

// DDR Sampling Extension (bits 31:28).
// Adjusts DDR data sampling point, range 0–15.
#define OSPI_LIOCFGCSN_DDRSMPEX_Pos   28
#define OSPI_LIOCFGCSN_DDRSMPEX_Msk   (0xFU << OSPI_LIOCFGCSN_DDRSMPEX_Pos)

// =============================================================================
// OSPI_BMCTL0 - Bridge Map Control Register 0
// Controls the access enable settings from each system bus channel (ch0) to the OSPI memory areas (CS0/CS1).
// This register is used to enable or disable read/write access to each OSPI memory area during memory-mapped operation.
// =============================================================================

// Channel 0 to CS0 access enable (bits 1:0).
// Controls access from system bus channel 0 to CS0 memory area.
// 0b00: Read/Write disable (no access)
// 0b01: Read enable, Write disable
// 0b10: Read disable, Write enable
// 0b11: Read/Write enable (full access)
#define OSPI_BMCTL0_CH0CS0ACC_Pos     0
#define OSPI_BMCTL0_CH0CS0ACC_Msk     (0x3U << OSPI_BMCTL0_CH0CS0ACC_Pos)

// Channel 0 to CS1 access enable (bits 3:2).
// Controls access from system bus channel 0 to CS1 memory area.
// 0b00: Read/Write disable (no access)
// 0b01: Read enable, Write disable
// 0b10: Read disable, Write enable
// 0b11: Read/Write enable (full access)
#define OSPI_BMCTL0_CH0CS1ACC_Pos     2
#define OSPI_BMCTL0_CH0CS1ACC_Msk     (0x3U << OSPI_BMCTL0_CH0CS1ACC_Pos)

// =============================================================================
// OSPI_BMCTL1 - Bridge Map Control Register 1
// BMCTL1 controls buffer operations for system bus channel 0:
// Manual push of write data from the combination buffer to the OSPI memory device (used in combination mode).
// Clearing the prefetch buffer for channel 0 (when prefetch is enabled).
// =============================================================================

// Memory Write Data Push for channel 0 (bit 8).
// Writing 1 pushes the pending data in the combination buffer to the memory device in combination mode.
// 0: No command
// 1: Push request (self-clearing bit)
#define OSPI_BMCTL1_MWRPUSHCH0_Pos    8
#define OSPI_BMCTL1_MWRPUSHCH0_Msk    (1U << OSPI_BMCTL1_MWRPUSHCH0_Pos)

// Prefetch Buffer Clear for channel 0 (bit 10).
// Writing 1 clears the prefetch buffer for channel 0. Should NOT be set during memory access.
// 0: No command
// 1: Clear request (self-clearing bit)
#define OSPI_BMCTL1_PBUFCLRCH0_Pos    10
#define OSPI_BMCTL1_PBUFCLRCH0_Msk    (1U << OSPI_BMCTL1_PBUFCLRCH0_Pos)

// =============================================================================
// OSPI_CMCTLCHn – Command Map Control Register for Channel n (n = 0, 1)
// CMCTLCHn controls the XiP (Execute in Place) mode for each OSPI channel.
// Allows enabling XiP mode and setting enter/exit codes for XiP operation.
// =============================================================================

// XiP Mode Enter Code (bits 0–7).
// Sets the code to enter XiP mode in memory-mapping mode.
// 0x00–0xFF: User-defined code
#define OSPI_CMCTLCHn_XIPENCODE_Pos   0
#define OSPI_CMCTLCHn_XIPENCODE_Msk   (0xFFU << OSPI_CMCTLCHn_XIPENCODE_Pos)

// XiP Mode Exit Code (bits 8–15).
// Sets the code to exit XiP mode in memory-mapping mode.
// 0x00–0xFF: User-defined code
#define OSPI_CMCTLCHn_XIPEXCODE_Pos   8
#define OSPI_CMCTLCHn_XIPEXCODE_Msk   (0xFFU << OSPI_CMCTLCHn_XIPEXCODE_Pos)

// XiP Mode Enable (bit 16).
// Enables or disables XiP mode in memory-mapping mode.
// 0: Disable XiP mode (exit code is inserted in the latency field)
// 1: Enable XiP mode (enter code is inserted in the latency field)
// This bit is automatically cleared when the XiP disable pattern is transmitted.
#define OSPI_CMCTLCHn_XIPEN_Pos       16
#define OSPI_CMCTLCHn_XIPEN_Msk       (1U << OSPI_CMCTLCHn_XIPEN_Pos)

// Bits [31:17] – Reserved. Always read as 0, should be written as 0.

// =============================================================================
// OSPI_CDCTL0 – Command Manual Control Register 0
// CDCTL0 controls manual and periodic command transactions on the OSPI interface.
// It allows you to issue manual commands, configure periodic polling, and select the
// target chip select and number of commands.
// =============================================================================

// Transaction Request (bit 0).
// Write 1 to start a manual command transaction. Cleared to 0 when the transaction completes or is canceled.
// 0: No transaction
// 1: Request transaction
#define OSPI_CDCTL0_TRREQ_Pos         0
#define OSPI_CDCTL0_TRREQ_Msk         (1U << OSPI_CDCTL0_TRREQ_Pos)

// Periodic Mode Enable (bit 1).
// Enables periodic transaction mode for status polling operations.
// 0: Direct manual-command mode
// 1: Periodic manual-command mode
#define OSPI_CDCTL0_PERMD_Pos         1
#define OSPI_CDCTL0_PERMD_Msk         (1U << OSPI_CDCTL0_PERMD_Pos)

// Chip Select (bit 3).
// Selects which memory device (CS0 or CS1) the command will be issued to.
// 0: CS0
// 1: CS1
#define OSPI_CDCTL0_CSSEL_Pos         3
#define OSPI_CDCTL0_CSSEL_Msk         (1U << OSPI_CDCTL0_CSSEL_Pos)

// Transaction Number (bits 4–5).
// Number of commands to issue in normal manual-command mode (0–3).
// 00: 1 command (buffer 0)
// 01: 2 commands (buffers 0–1)
// 10: 3 commands (buffers 0–2)
// 11: 4 commands (buffers 0–3)
#define OSPI_CDCTL0_TRNUM_Pos         4
#define OSPI_CDCTL0_TRNUM_Msk         (0x3U << OSPI_CDCTL0_TRNUM_Pos)

// Periodic Transaction Interval (bits 16–20).
// Interval between periodic transactions (in periodic mode).
// Should be longer than 4 times the CPU bus cycle.
// 0x00: 2 cycles
// 0x01: 4 cycles
// ...
// 0x1E: 2,147,483,648 cycles
// 0x1F: 4,294,967,296 cycles
#define OSPI_CDCTL0_PERITV_Pos        16
#define OSPI_CDCTL0_PERITV_Msk        (0x1FU << OSPI_CDCTL0_PERITV_Pos)

