Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
// Periodic Transaction Repeat (bits 24–27).
// Number of repetitions for periodic transactions (in periodic mode).
// 0x0: 1 time
// 0x1: 2 times
// ...
// 0xE: 16,384 times
// 0xF: 32,768 times
#define OSPI_CDCTL0_PERREP_Pos        24
#define OSPI_CDCTL0_PERREP_Msk        (0xFU << OSPI_CDCTL0_PERREP_Pos)

// All other bits are reserved. Always read as 0, should be written as 0.

// =============================================================================
// OSPI_CDCTL1 – Command Manual Control Register 1
// CDCTL1 configures the expected value for periodic transactions in periodic manual-command mode.
// The register is used for status polling operations, where read data is compared with this expected value.
// =============================================================================

// Periodic Transaction Expected Value (bits 0–31).
// Sets the expected value to compare with the read value in periodic manual-command mode.
// For example, if comparing 1 byte, configure the lower byte.
#define OSPI_CDCTL1_PEREXP_Pos        0
#define OSPI_CDCTL1_PEREXP_Msk        (0xFFFFFFFFUL << OSPI_CDCTL1_PEREXP_Pos)

// =============================================================================
// OSPI_CDCTL2 – Command Manual Control Register 2
// CDCTL2 sets the mask value for periodic transactions in periodic manual-command mode.
// Any bit set to 1 in this register will cause the corresponding bit in the expected value (CDCTL1) to be ignored during comparison.
// =============================================================================

// Periodic Transaction Masked Value (bits 0–31).
// Sets the mask for the expected value in periodic manual-command mode.
// When a bit is set to 1, the corresponding bit in CDCTL1.PEREXP is ignored during comparison.
// For 8D-8D-8D mode, only even byte-pairs are transferred; unused bits should be masked (e.g., 0xFFFFFF00 for 1 byte).
#define OSPI_CDCTL2_PERMSK_Pos        0
#define OSPI_CDCTL2_PERMSK_Msk        (0xFFFFFFFFUL << OSPI_CDCTL2_PERMSK_Pos)

// =============================================================================
// OSPI_CDTBUFn – Command Manual Type Buffer n (n = 0 to 3)
// CDTBUFn configures the command, address, data size, latency, and type for each manual command buffer.
// This register defines the fields for a manual command issued through the OSPI interface.
// =============================================================================

// Command Size (bits 0–1).
// Specifies the number of bytes in the command phase.
// In 8D-8D-8D mode, this must be set to 2 (0b10).
// Both command size and address size must not be set to zero simultaneously.
// 00: 0 bytes (No command phase)
// 01: 1 byte
// 10: 2 bytes
#define OSPI_CDTBUFn_CMDSIZE_Pos      0
#define OSPI_CDTBUFn_CMDSIZE_Msk      (0x3U << OSPI_CDTBUFn_CMDSIZE_Pos)

// Address Size (bits 2–4).
// Specifies the number of bytes in the address phase.
// 000: 0 bytes (No address phase)
// 001: 1 byte
// 010: 2 bytes
// 011: 3 bytes
// 100: 4 bytes
#define OSPI_CDTBUFn_ADDSIZE_Pos      2
#define OSPI_CDTBUFn_ADDSIZE_Msk      (0x7U << OSPI_CDTBUFn_ADDSIZE_Pos)

// Data Size (bits 5–8).
// Specifies the number of bytes in the data phase.
// In 8D-8D-8D mode, only even byte counts are valid for data transfer.
// 0x0: 0 bytes (No data phase)
// 0x1: 1 byte
// ...
// 0x8: 8 bytes
#define OSPI_CDTBUFn_DATASIZE_Pos     5
#define OSPI_CDTBUFn_DATASIZE_Msk     (0xFU << OSPI_CDTBUFn_DATASIZE_Pos)

// Latency Cycle (bits 9–13).
// Specifies the number of dummy cycles (latency cycles) inserted.
// 0x0: No latency
// 0x1: 1 cycle
// ...
// 0x1F: 31 cycles
#define OSPI_CDTBUFn_LATE_Pos         9
#define OSPI_CDTBUFn_LATE_Msk         (0x1FU << OSPI_CDTBUFn_LATE_Pos)

// Reserved (bit 14).
// Always read as 0; write value should be 0.

// Transaction Type (bit 15).
// Selects the type of transaction for this buffer.
// 0: Read transaction (readout from slave device)
// 1: Not read transaction (typically write)
#define OSPI_CDTBUFn_TRTYPE_Pos       15
#define OSPI_CDTBUFn_TRTYPE_Msk       (1U << OSPI_CDTBUFn_TRTYPE_Pos)

// Command (bits 16–31).
// Specifies the command code to be issued during the manual command transaction.
// The number of bytes used is determined by CMDSIZE.
// For 8D-8D-8D mode, the meaning of bits varies by profile.
#define OSPI_CDTBUFn_CMD_Pos          16
#define OSPI_CDTBUFn_CMD_Msk          (0xFFFFU << OSPI_CDTBUFn_CMD_Pos)

// =============================================================================
// OSPI_CDABUFn – Command Manual Address Buffer n (n = 0 to 3)
// CDABUFn sets the address field used for manual command operations via the OSPI interface.
// For profile 2.0 (8D-8D-8D), this field may be used as part of the command & modifier field.
// =============================================================================

// Address (bits 0–31).
// Sets the address to be used in manual-command mode.
// For 1S-1S-1S, 4S-4D-4D, and 8D-8D-8D profile 1.0: this is the address field.
// For 8D-8D-8D profile 2.0: this field is used as the lower 4 bytes of the command & modifier field.
#define OSPI_CDABUFn_ADD_Pos          0
#define OSPI_CDABUFn_ADD_Msk          (0xFFFFFFFFUL << OSPI_CDABUFn_ADD_Pos)

// =============================================================================
// OSPI_CDD0BUFn – Command Manual Data 0 Buffer n (n = 0 to 3)
// CDD0BUFn is used to set or retrieve data for manual command operations via the OSPI interface.
// For write transactions, this register provides the write data.
// For read transactions, the received data is stored in this register after the operation.
// =============================================================================

// Data (bits 0–31).
// Sets the data to be written or read in manual-command mode.
// For write transactions: set the value to be transmitted.
// For read transactions: the received data will be stored here.
#define OSPI_CDD0BUFn_DATA_Pos        0
#define OSPI_CDD0BUFn_DATA_Msk        (0xFFFFFFFFUL << OSPI_CDD0BUFn_DATA_Pos)

