Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
// =============================================================================
// OSPI_CDD1BUFn – Command Manual Data 1 Buffer n (n = 0 to 3)
// CDD1BUFn is used to set or retrieve additional data for manual command operations via the OSPI interface.
// For write transactions, this register provides additional write data.
// For read transactions, additional received data is stored in this register after the operation.
// =============================================================================

// Data (bits 0–31).
// Sets the data to be written or read in manual-command mode.
// For write transactions: set the value to be transmitted.
// For read transactions: the received data will be stored here.
#define OSPI_CDD1BUFn_DATA_Pos        0
#define OSPI_CDD1BUFn_DATA_Msk        (0xFFFFFFFFUL << OSPI_CDD1BUFn_DATA_Pos)

// =============================================================================
// OSPI_LPCTL0 – Link Pattern Control Register 0
// LPCTL0 is used to configure and request transmission of the XiP Disable pattern on the OSPI link.
// It controls the pins, timing, and values of the pattern phases sent to the external memory.
// =============================================================================

// Pattern Request (bit 0).
// Write 1 to start transmission of the XiP Disable pattern. Cleared to 0 when the pattern completes.
// 0: No request (XiP Disable pattern not issued)
// 1: Request XiP Disable pattern
#define OSPI_LPCTL0_PATREQ_Pos        0
#define OSPI_LPCTL0_PATREQ_Msk        (1U << OSPI_LPCTL0_PATREQ_Pos)

// Chip Select (bit 3).
// Selects the target memory (chip select) for pattern transmission.
// 0: slave0 (CS0)
// 1: slave1 (CS1)
#define OSPI_LPCTL0_CSSEL_Pos         3
#define OSPI_LPCTL0_CSSEL_Msk         (1U << OSPI_LPCTL0_CSSEL_Pos)

// XiP Disable Pattern Pin (bits 4–5).
// Selects the number of pins used for the XiP Disable pattern output.
// 00: 1 pin
// 01: 2 pins
// 10: 4 pins
// 11: 8 pins
#define OSPI_LPCTL0_XDPIN_Pos         4
#define OSPI_LPCTL0_XDPIN_Msk         (0x3U << OSPI_LPCTL0_XDPIN_Pos)

// XiP Disable Pattern 1st Phase Length (bits 16–20).
// Number of cycles for the 1st phase of the XiP Disable pattern.
// 0x0: 0 cycles
// ...
// 0x1F: 31 cycles
#define OSPI_LPCTL0_XD1LEN_Pos        16
#define OSPI_LPCTL0_XD1LEN_Msk        (0x1FU << OSPI_LPCTL0_XD1LEN_Pos)

// XiP Disable Pattern 1st Phase Value (bit 23).
// Output value for the 1st phase.
// 0: Low drive
// 1: High drive
#define OSPI_LPCTL0_XD1VAL_Pos        23
#define OSPI_LPCTL0_XD1VAL_Msk        (1U << OSPI_LPCTL0_XD1VAL_Pos)

// XiP Disable Pattern 2nd Phase Length (bits 24–28).
// Number of cycles for the 2nd phase of the XiP Disable pattern.
// 0x00: 0 cycles
// ...
// 0x1F: 31 cycles
#define OSPI_LPCTL0_XD2LEN_Pos        24
#define OSPI_LPCTL0_XD2LEN_Msk        (0x1FU << OSPI_LPCTL0_XD2LEN_Pos)

// XiP Disable Pattern 2nd Phase Value (bit 31).
// Output value for the 2nd phase.
// 0: Low drive
// 1: High drive
#define OSPI_LPCTL0_XD2VAL_Pos        31
#define OSPI_LPCTL0_XD2VAL_Msk        (1U << OSPI_LPCTL0_XD2VAL_Pos)

// All other bits are reserved. Always read as 0, should be written as 0.

// =============================================================================
// OSPI_LPCTL1 – Link Pattern Control Register 1
// LPCTL1 is used to request and configure reset or CS-only patterns on the OSPI link.
// It controls the chip select target, number of repeats, timing, and data output setup for reset signaling.
// =============================================================================

// Pattern Request (bits 0–1).
// Requests transmission of a pattern. Cleared to 00b when the pattern completes.
// 00: No request
// 01: Request Reset pattern
// 10: Request CS-only pattern
// 11: Setting prohibited
#define OSPI_LPCTL1_PATREQ_Pos        0
#define OSPI_LPCTL1_PATREQ_Msk        (0x3U << OSPI_LPCTL1_PATREQ_Pos)

// Chip Select (bit 3).
// Selects the target memory (chip select) for pattern transmission.
// 0: slave0 (CS0)
// 1: slave1 (CS1)
#define OSPI_LPCTL1_CSSEL_Pos         3
#define OSPI_LPCTL1_CSSEL_Msk         (1U << OSPI_LPCTL1_CSSEL_Pos)

// Reset Pattern Repeat (bits 4–5).
// Number of times to toggle CS from LOW to HIGH during reset pattern.
// 00: 4 times (per protocol)
// 01: 5 times
// 10: 6 times
// 11: 7 times
#define OSPI_LPCTL1_RSTREP_Pos        4
#define OSPI_LPCTL1_RSTREP_Msk        (0x3U << OSPI_LPCTL1_RSTREP_Pos)

// Reset Pattern Width (bits 8–10).
// Width (in cycles) of each CS toggle during reset/CS-only pattern.
// 000: 2 cycles
// 001: 4 cycles
// ...
// 110: 128 cycles
// 111: 256 cycles
#define OSPI_LPCTL1_RSTWID_Pos        8
#define OSPI_LPCTL1_RSTWID_Msk        (0x7U << OSPI_LPCTL1_RSTWID_Pos)

// Reset Pattern Data Output Setup Time (bits 12–14).
// Number of setup cycles for data output, based on CS edge during reset pattern.
// Should be less than the pattern width.
// 000: 1 cycle
// 001: 2 cycles
// ...
// 110: 7 cycles
// 111: 8 cycles
#define OSPI_LPCTL1_RSTSU_Pos         12
#define OSPI_LPCTL1_RSTSU_Msk         (0x7U << OSPI_LPCTL1_RSTSU_Pos)

// All other bits are reserved. Always read as 0, should be written as 0.

// =============================================================================
// OSPI_LIOCTL – Link I/O Control Register
// LIOCTL controls the output value of the Write Protect (WP) and Reset (RST) pins for the OSPI slave devices.
// It allows the firmware to manually drive these control lines, if supported by the attached xSPI memory.
// =============================================================================

// Write Protect for Slave 1 (bit 1).
// Controls the output value of the OM_WP1 port (Write Protect for slave1).
// 0: Drive Low level
// 1: Drive High level
#define OSPI_LIOCTL_WPCS1_Pos         1
#define OSPI_LIOCTL_WPCS1_Msk         (1U << OSPI_LIOCTL_WPCS1_Pos)

// Reset Drive for Slave 0 (bit 16).
// Controls the output value of the OM_RESET port (Reset for slave0).
// 0: Drive Low level
// 1: Drive High level
#define OSPI_LIOCTL_RSTCS0_Pos        16
#define OSPI_LIOCTL_RSTCS0_Msk        (1U << OSPI_LIOCTL_RSTCS0_Pos)

// Bit 0 and Bit 17 are always read as 1, and should be written as 1.
// All other bits are reserved. Always read as 0, should be written as 0.

