Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
// =============================================================================
// OSPI_CCCTL0CSn – Command Calibration Control Register 0 CSn (n = 0, 1)
// CCCTL0CSn configures and enables automatic calibration for each xSPI slave channel (chip select).
// It sets up calibration intervals, DQS shift range, and enables or disables the calibration sequence.
// =============================================================================

// Automatic Calibration Enable (bit 0).
// Enables automatic calibration sequence for the target chip select.
// 0: Disable automatic calibration
// 1: Enable automatic calibration
#define OSPI_CCCTL0CSn_CAEN_Pos       0
#define OSPI_CCCTL0CSn_CAEN_Msk       (1U << OSPI_CCCTL0CSn_CAEN_Pos)

// Calibration No Write Mode (bit 1).
// Selects whether the calibration sequence omits the write command.
// 0: Calibration with write command
// 1: Calibration without write command (for devices with fixed calibration data)
#define OSPI_CCCTL0CSn_CANOWR_Pos     1
#define OSPI_CCCTL0CSn_CANOWR_Msk     (1U << OSPI_CCCTL0CSn_CANOWR_Pos)

// Calibration Interval (bits 8–12).
// Interval (in cycles) between calibration patterns.
// 0x00: 2 cycles
// 0x01: 4 cycles
// ...
// 0x1F: 4,294,967,296 cycles
#define OSPI_CCCTL0CSn_CAITV_Pos      8
#define OSPI_CCCTL0CSn_CAITV_Msk      (0x1FU << OSPI_CCCTL0CSn_CAITV_Pos)

// Calibration OM_DQS Shift Start Value (bits 16–20).
// Start value for OM_DQS shift during calibration.
#define OSPI_CCCTL0CSn_CASFTSTA_Pos   16
#define OSPI_CCCTL0CSn_CASFTSTA_Msk   (0x1FU << OSPI_CCCTL0CSn_CASFTSTA_Pos)

// Calibration OM_DQS Shift End Value (bits 24–28).
// End value for OM_DQS shift during calibration. Must be equal or greater than start value.
#define OSPI_CCCTL0CSn_CASFTEND_Pos   24
#define OSPI_CCCTL0CSn_CASFTEND_Msk   (0x1FU << OSPI_CCCTL0CSn_CASFTEND_Pos)

// All other bits are reserved. Always read as 0, should be written as 0.

// =============================================================================
// OSPI_CCCTL1CSn – Command Calibration Control Register 1 CSn (n = 0, 1)
// CCCTL1CSn configures the command, address, data sizes, and latency cycles for read and write calibration frames for each xSPI slave channel.
// =============================================================================

// Command Size (bits 0–1).
// Sets the size of the command field for the calibration sequence.
// In 8D-8D-8D mode, must be set to 2 (0b10).
// 00: 0 bytes (No command phase)
// 01: 1 byte
// 10: 2 bytes
// 11: Setting prohibited
#define OSPI_CCCTL1CSn_CACMDSIZE_Pos  0
#define OSPI_CCCTL1CSn_CACMDSIZE_Msk  (0x3U << OSPI_CCCTL1CSn_CACMDSIZE_Pos)

// Address Size (bits 2–4).
// Sets the size of the address field for the calibration sequence.
// 000: 0 bytes (No address phase)
// 001: 1 byte
// 010: 2 bytes
// 011: 3 bytes
// 100: 4 bytes
#define OSPI_CCCTL1CSn_CAADDSIZE_Pos  2
#define OSPI_CCCTL1CSn_CAADDSIZE_Msk  (0x7U << OSPI_CCCTL1CSn_CAADDSIZE_Pos)

// Data Size (bits 5–8).
// Sets the size of the data field for calibration.
// In 8D-8D-8D mode, must be an even value.
// 0x0: 1 byte
// 0x1: 2 bytes
// ...
// 0xF: 16 bytes
#define OSPI_CCCTL1CSn_CADATASIZE_Pos 5
#define OSPI_CCCTL1CSn_CADATASIZE_Msk (0xFU << OSPI_CCCTL1CSn_CADATASIZE_Pos)

// Write Latency Cycle (bits 16–20).
// Number of latency cycles for the write calibration frame.
// 0x00: No latency
// 0x01: 1 cycle
// ...
// 0x1F: 31 cycles
#define OSPI_CCCTL1CSn_CAWRLATE_Pos   16
#define OSPI_CCCTL1CSn_CAWRLATE_Msk   (0x1FU << OSPI_CCCTL1CSn_CAWRLATE_Pos)

// Read Latency Cycle (bits 24–28).
// Number of latency cycles for the read calibration frame.
// 0x00: No latency
// 0x01: 1 cycle
// ...
// 0x1F: 31 cycles
#define OSPI_CCCTL1CSn_CARDLATE_Pos   24
#define OSPI_CCCTL1CSn_CARDLATE_Msk   (0x1FU << OSPI_CCCTL1CSn_CARDLATE_Pos)

// All other bits are reserved. Always read as 0, should be written as 0.

// =============================================================================
// OSPI_CCCTL2CSn – Command Calibration Control Register 2 CSn (n = 0, 1)
// CCCTL2CSn sets the command values for the calibration read and write patterns for each xSPI slave channel.
// =============================================================================

// Calibration Pattern Write Command (bits 0–15).
// Sets the command code for the calibration pattern write operation.
#define OSPI_CCCTL2CSn_CAWRCMD_Pos    0
#define OSPI_CCCTL2CSn_CAWRCMD_Msk    (0xFFFFU << OSPI_CCCTL2CSn_CAWRCMD_Pos)

// Calibration Pattern Read Command (bits 16–31).
// Sets the command code for the calibration pattern read operation.
#define OSPI_CCCTL2CSn_CARDCMD_Pos    16
#define OSPI_CCCTL2CSn_CARDCMD_Msk    (0xFFFFU << OSPI_CCCTL2CSn_CARDCMD_Pos)

// =============================================================================
// OSPI_CCCTL3CSn – Command Calibration Control Register 3 CSn (n = 0, 1)
// CCCTL3CSn sets the address used for the calibration pattern operation for each xSPI slave channel.
// =============================================================================

// Calibration Pattern Address (bits 0–31).
// Sets the address for the calibration pattern operation during calibration sequences.
#define OSPI_CCCTL3CSn_CAADD_Pos      0
#define OSPI_CCCTL3CSn_CAADD_Msk      (0xFFFFFFFFUL << OSPI_CCCTL3CSn_CAADD_Pos)

// =============================================================================
// OSPI_CCCTL4CSn – Command Calibration Control Register 4 CSn (n = 0, 1)
// CCCTL4CSn sets the data value for the calibration pattern operation for each xSPI slave channel.
// =============================================================================

// Calibration Pattern Data (bits 0–31).
// Sets the data value for the calibration pattern during calibration sequences.
#define OSPI_CCCTL4CSn_CADATA_Pos     0
#define OSPI_CCCTL4CSn_CADATA_Msk     (0xFFFFFFFFUL << OSPI_CCCTL4CSn_CADATA_Pos)

// =============================================================================
// OSPI_CCCTL5CSn – Command Calibration Control Register 5 CSn (n = 0, 1)
// CCCTL5CSn sets the second data value for the calibration pattern operation for each xSPI slave channel.
// =============================================================================

// Calibration Pattern Data (bits 0–31).
// Sets the second data value for the calibration pattern during calibration sequences.
#define OSPI_CCCTL5CSn_CADATA_Pos     0
#define OSPI_CCCTL5CSn_CADATA_Msk     (0xFFFFFFFFUL << OSPI_CCCTL5CSn_CADATA_Pos)

