Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
// =============================================================================
// OSPI_CCCTL6CSn – Command Calibration Control Register 6 CSn (n = 0, 1)
// CCCTL6CSn sets the third data value for the calibration pattern operation for each xSPI slave channel.
// =============================================================================

// Calibration Pattern Data (bits 0–31).
// Sets the third data value for the calibration pattern during calibration sequences.
#define OSPI_CCCTL6CSn_CADATA_Pos     0
#define OSPI_CCCTL6CSn_CADATA_Msk     (0xFFFFFFFFUL << OSPI_CCCTL6CSn_CADATA_Pos)

// =============================================================================
// OSPI_CCCTL7CSn – Command Calibration Control Register 7 CSn (n = 0, 1)
// CCCTL7CSn sets the fourth data value for the calibration pattern operation for each xSPI slave channel.
// =============================================================================

// Calibration Pattern Data (bits 0–31).
// Sets the fourth data value for the calibration pattern during calibration sequences.
#define OSPI_CCCTL7CSn_CADATA_Pos     0
#define OSPI_CCCTL7CSn_CADATA_Msk     (0xFFFFFFFFUL << OSPI_CCCTL7CSn_CADATA_Pos)

// =============================================================================
// OSPI_COMSTT - OSPI Common Status Register
// COMSTT monitors the overall status of the xSPI Master.
// This register contains various status bits related to memory access, prefetch, buffer status, and external signals.
// =============================================================================

// Memory access ongoing from channel 0 (bit 0).
// Indicates whether system bus bridge channel 0 is accessing the memory.
// 0: Not accessing
// 1: Accessing
#define OSPI_COMSTT_MEMACCCH0_Pos     0
#define OSPI_COMSTT_MEMACCCH0_Msk     (1U << OSPI_COMSTT_MEMACCCH0_Pos)

// Prefetch Buffer Not Empty for channel 0 (bit 4).
// Indicates whether the prefetch buffer for channel 0 contains data.
// 0: Empty
// 1: Not empty
#define OSPI_COMSTT_PBUFNECH0_Pos     4
#define OSPI_COMSTT_PBUFNECH0_Msk     (1U << OSPI_COMSTT_PBUFNECH0_Pos)

// Write Buffer Not Empty for channel 0 (bit 6).
// Indicates whether the write buffer for channel 0 contains data.
// 0: Empty
// 1: Not empty
#define OSPI_COMSTT_WRBUFNECH0_Pos    6
#define OSPI_COMSTT_WRBUFNECH0_Msk    (1U << OSPI_COMSTT_WRBUFNECH0_Pos)

// ECS monitor for slave 1 (bit 20).
// Indicates the value of the OM_ECSINT1 port.
// 0: Low level
// 1: High level
#define OSPI_COMSTT_ECSCS1_Pos        20
#define OSPI_COMSTT_ECSCS1_Msk        (1U << OSPI_COMSTT_ECSCS1_Pos)

// INT monitor for slave 1 (bit 21).
// Indicates the value of the OM_ECSINT1 port.
// 0: Low level
// 1: High level
#define OSPI_COMSTT_INTCS1_Pos        21
#define OSPI_COMSTT_INTCS1_Msk        (1U << OSPI_COMSTT_INTCS1_Pos)

// RSTO monitor for slave 1 (bit 22).
// Indicates the value of the OM_RSTO1 port.
// 0: Low level
// 1: High level
#define OSPI_COMSTT_RSTOCS1_Pos       22
#define OSPI_COMSTT_RSTOCS1_Msk       (1U << OSPI_COMSTT_RSTOCS1_Pos)

// Note: Bits 3:1, 5, and 19:7, and 31:23 are reserved and read as 0.

// =============================================================================
// OSPI_CASTTCSn - OSPI Calibration Status Register CSn (n = 0, 1)
// CASTTCSn indicates calibration success for each OM_DQS shift value for slave n.
// This register is updated after each calibration sequence.
// =============================================================================

// Calibration Success for each OM_DQS shift value (bits 0..31).
// Each bit CASUC[x] indicates calibration success for OM_DQS shift value = x.
// 0: Calibration failed for this shift value
// 1: Calibration succeeded for this shift value
#define OSPI_CASTTCSn_CASUC_Pos       0
#define OSPI_CASTTCSn_CASUC_Msk       (0xFFFFFFFFUL << OSPI_CASTTCSn_CASUC_Pos)

// =============================================================================
// OSPI_INTS - OSPI Interrupt Status Register
// INTS indicates interrupt status flags for xSPI Master, including command completion, pattern completion, errors, and calibration status.
// Each flag is set when the corresponding event occurs, and is cleared by writing 1 to the corresponding bit in the INTC register.
// =============================================================================

// Command Completed (bit 0).
// Set to 1 when a manual command transaction completes.
// 0: No detection
// 1: Detection
#define OSPI_INTS_CMDCMP_Pos          0
#define OSPI_INTS_CMDCMP_Msk          (1U << OSPI_INTS_CMDCMP_Pos)

// Pattern Completed (bit 1).
// Set to 1 when the requested pattern is completed.
// 0: No detection
// 1: Detection
#define OSPI_INTS_PATCMP_Pos          1
#define OSPI_INTS_PATCMP_Msk          (1U << OSPI_INTS_PATCMP_Pos)

// Periodic Transaction Timeout (bit 3).
// Set to 1 when a timeout occurs in periodic manual-command mode.
// 0: No detection
// 1: Detection
#define OSPI_INTS_PERTO_Pos           3
#define OSPI_INTS_PERTO_Msk           (1U << OSPI_INTS_PERTO_Pos)

// OM_DQS Timeout for slave0 (bit 4).
// Set to 1 when OM_DQS is lost in a read transaction for slave0.
// 0: No detection
// 1: Detection
#define OSPI_INTS_DSTOCS0_Pos         4
#define OSPI_INTS_DSTOCS0_Msk         (1U << OSPI_INTS_DSTOCS0_Pos)

// OM_DQS Timeout for slave1 (bit 5).
// Set to 1 when OM_DQS is lost in a read transaction for slave1.
// 0: No detection
// 1: Detection
#define OSPI_INTS_DSTOCS1_Pos         5
#define OSPI_INTS_DSTOCS1_Msk         (1U << OSPI_INTS_DSTOCS1_Pos)

// ECC error detection for slave1 (bit 9).
// Set to 1 when a falling edge is detected on OM_ECSINT1 port.
// 0: No detection
// 1: Detection
#define OSPI_INTS_ECSCS1_Pos          9
#define OSPI_INTS_ECSCS1_Msk          (1U << OSPI_INTS_ECSCS1_Pos)

// Interrupt detection for slave1 (bit 13).
// Set to 1 when a falling edge is detected on OM_ECSINT1 port for slave1.
// 0: No detection
// 1: Detection
#define OSPI_INTS_INTCS1_Pos          13
#define OSPI_INTS_INTCS1_Msk          (1U << OSPI_INTS_INTCS1_Pos)

// System bus error for channel 0 (bit 20).
// Set to 1 when an error response occurs on system bus channel 0.
// 0: No detection
// 1: Detection
#define OSPI_INTS_BUSERRCH0_Pos       20
#define OSPI_INTS_BUSERRCH0_Msk       (1U << OSPI_INTS_BUSERRCH0_Pos)

// Calibration failed for slave0 (bit 28).
// Set to 1 when calibration fails for slave0.
// 0: No detection
// 1: Detection
#define OSPI_INTS_CAFAILCS0_Pos       28
#define OSPI_INTS_CAFAILCS0_Msk       (1U << OSPI_INTS_CAFAILCS0_Pos)

// Calibration failed for slave1 (bit 29).
// Set to 1 when calibration fails for slave1.
// 0: No detection
// 1: Detection
#define OSPI_INTS_CAFAILCS1_Pos       29
#define OSPI_INTS_CAFAILCS1_Msk       (1U << OSPI_INTS_CAFAILCS1_Pos)

// Calibration success for slave0 (bit 30).
// Set to 1 when calibration succeeds for slave0.
// 0: No detection
// 1: Detection
#define OSPI_INTS_CASUCCS0_Pos        30
#define OSPI_INTS_CASUCCS0_Msk        (1U << OSPI_INTS_CASUCCS0_Pos)

