Indemsys/MC80_4DC/src/Board/RA8M1_OSPI.h
// Calibration success for slave1 (bit 31).
// Set to 1 when calibration succeeds for slave1.
// 0: No detection
// 1: Detection
#define OSPI_INTS_CASUCCS1_Pos        31
#define OSPI_INTS_CASUCCS1_Msk        (1U << OSPI_INTS_CASUCCS1_Pos)

// Reserved bits: 2, 6-8, 10-12, 14-19, 21-27 (read as 0).

// =============================================================================
// OSPI_INTC - OSPI Interrupt Clear Register
// INTC clears the interrupt flags of the xSPI Master.
// Writing 1 to any bit clears the corresponding interrupt status flag in INTS.
// Writing 0 has no effect.
// =============================================================================

// Command Completed interrupt clear (bit 0).
// Write 1 to clear the Command Completed interrupt flag (INTS.CMDCMP).
#define OSPI_INTC_CMDCMPC_Pos         0
#define OSPI_INTC_CMDCMPC_Msk         (1U << OSPI_INTC_CMDCMPC_Pos)

// Pattern Completed interrupt clear (bit 1).
// Write 1 to clear the Pattern Completed interrupt flag (INTS.PATCMP).
#define OSPI_INTC_PATCMPC_Pos         1
#define OSPI_INTC_PATCMPC_Msk         (1U << OSPI_INTC_PATCMPC_Pos)

// Periodic transaction timeout interrupt clear (bit 3).
// Write 1 to clear the Periodic Transaction Timeout interrupt flag (INTS.PERTO).
#define OSPI_INTC_PERTOC_Pos          3
#define OSPI_INTC_PERTOC_Msk          (1U << OSPI_INTC_PERTOC_Pos)

// OM_DQS timeout for slave0 interrupt clear (bit 4).
// Write 1 to clear the OM_DQS timeout interrupt flag for slave0 (INTS.DSTOCS0).
#define OSPI_INTC_DSTOCS0C_Pos        4
#define OSPI_INTC_DSTOCS0C_Msk        (1U << OSPI_INTC_DSTOCS0C_Pos)

// OM_DQS timeout for slave1 interrupt clear (bit 5).
// Write 1 to clear the OM_DQS timeout interrupt flag for slave1 (INTS.DSTOCS1).
#define OSPI_INTC_DSTOCS1C_Pos        5
#define OSPI_INTC_DSTOCS1C_Msk        (1U << OSPI_INTC_DSTOCS1C_Pos)

// ECC error detection for slave1 interrupt clear (bit 9).
// Write 1 to clear the ECC error detection interrupt flag for slave1 (INTS.ECSCS1).
#define OSPI_INTC_ECSCS1C_Pos         9
#define OSPI_INTC_ECSCS1C_Msk         (1U << OSPI_INTC_ECSCS1C_Pos)

// Interrupt detection for slave1 interrupt clear (bit 13).
// Write 1 to clear the interrupt detection flag for slave1 (INTS.INTCS1).
#define OSPI_INTC_INTCS1C_Pos         13
#define OSPI_INTC_INTCS1C_Msk         (1U << OSPI_INTC_INTCS1C_Pos)

// System bus error for ch0 interrupt clear (bit 20).
// Write 1 to clear the system bus error interrupt flag for channel 0 (INTS.BUSERRCH0).
#define OSPI_INTC_BUSERRCH0C_Pos      20
#define OSPI_INTC_BUSERRCH0C_Msk      (1U << OSPI_INTC_BUSERRCH0C_Pos)

// Calibration failed for slave0 interrupt clear (bit 28).
// Write 1 to clear the calibration failed interrupt flag for slave0 (INTS.CAFAILCS0).
#define OSPI_INTC_CAFAILCS0C_Pos      28
#define OSPI_INTC_CAFAILCS0C_Msk      (1U << OSPI_INTC_CAFAILCS0C_Pos)

// Calibration failed for slave1 interrupt clear (bit 29).
// Write 1 to clear the calibration failed interrupt flag for slave1 (INTS.CAFAILCS1).
#define OSPI_INTC_CAFAILCS1C_Pos      29
#define OSPI_INTC_CAFAILCS1C_Msk      (1U << OSPI_INTC_CAFAILCS1C_Pos)

// Calibration success for slave0 interrupt clear (bit 30).
// Write 1 to clear the calibration success interrupt flag for slave0 (INTS.CASUCCS0).
#define OSPI_INTC_CASUCCS0C_Pos       30
#define OSPI_INTC_CASUCCS0C_Msk       (1U << OSPI_INTC_CASUCCS0C_Pos)

// Calibration success for slave1 interrupt clear (bit 31).
// Write 1 to clear the calibration success interrupt flag for slave1 (INTS.CASUCCS1).
#define OSPI_INTC_CASUCCS1C_Pos       31
#define OSPI_INTC_CASUCCS1C_Msk       (1U << OSPI_INTC_CASUCCS1C_Pos)

// Reserved bits: 2, 6-8, 10-12, 14-19, 21-27 (write 0).

// =============================================================================
// OSPI_INTE - OSPI Interrupt Enable Register
// INTE enables or disables interrupt sources for xSPI Master.
// Each bit enables the corresponding interrupt in the INTS register.
// =============================================================================

// Command Completed interrupt enable (bit 0).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_CMDCMPE_Pos         0
#define OSPI_INTE_CMDCMPE_Msk         (1U << OSPI_INTE_CMDCMPE_Pos)

// Pattern Completed interrupt enable (bit 1).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_PATCMPE_Pos         1
#define OSPI_INTE_PATCMPE_Msk         (1U << OSPI_INTE_PATCMPE_Pos)

// Periodic transaction timeout interrupt enable (bit 3).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_PERTOE_Pos          3
#define OSPI_INTE_PERTOE_Msk          (1U << OSPI_INTE_PERTOE_Pos)

// OM_DQS timeout for slave0 interrupt enable (bit 4).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_DSTOCS0E_Pos        4
#define OSPI_INTE_DSTOCS0E_Msk        (1U << OSPI_INTE_DSTOCS0E_Pos)

// OM_DQS timeout for slave1 interrupt enable (bit 5).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_DSTOCS1E_Pos        5
#define OSPI_INTE_DSTOCS1E_Msk        (1U << OSPI_INTE_DSTOCS1E_Pos)

// ECC error detection for slave1 interrupt enable (bit 9).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_ECSCS1E_Pos         9
#define OSPI_INTE_ECSCS1E_Msk         (1U << OSPI_INTE_ECSCS1E_Pos)

// Interrupt detection for slave1 interrupt enable (bit 13).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_INTCS1E_Pos         13
#define OSPI_INTE_INTCS1E_Msk         (1U << OSPI_INTE_INTCS1E_Pos)

// System bus error for channel 0 interrupt enable (bit 20).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_BUSERRCH0E_Pos      20
#define OSPI_INTE_BUSERRCH0E_Msk      (1U << OSPI_INTE_BUSERRCH0E_Pos)

// Calibration failed for slave0 interrupt enable (bit 28).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_CAFAILCS0E_Pos      28
#define OSPI_INTE_CAFAILCS0E_Msk      (1U << OSPI_INTE_CAFAILCS0E_Pos)

// Calibration failed for slave1 interrupt enable (bit 29).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_CAFAILCS1E_Pos      29
#define OSPI_INTE_CAFAILCS1E_Msk      (1U << OSPI_INTE_CAFAILCS1E_Pos)

// Calibration success for slave0 interrupt enable (bit 30).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_CASUCCS0E_Pos       30
#define OSPI_INTE_CASUCCS0E_Msk       (1U << OSPI_INTE_CASUCCS0E_Pos)

// Calibration success for slave1 interrupt enable (bit 31).
// 0: Disabled
// 1: Enabled
#define OSPI_INTE_CASUCCS1E_Pos       31
#define OSPI_INTE_CASUCCS1E_Msk       (1U << OSPI_INTE_CASUCCS1E_Pos)

// Reserved bits: 2, 6-8, 10-12, 14-19, 21-27 (read as 0, write 0).

#endif  // RA8M1_OSPI_H
